{
  "users": [
    {
      "email": "joao@mail.com",
      "password": "$2a$10$hpnIkTmknTrq8E2OE.ZgnOjJRUt7f1W5Zla8K/Dvn1wU4Q6UiqHUW",
      "name": "Joao da Silva",
      "dateOfBirth": "01/10/97",
      "CPF": "009888666321",
      "is_admin": "false",
      "vacAlreadyTaken":[],
      "id": 1
    },
    {
      "email": "maria@mail.com",
      "password": "$2a$10$UdYd5PDwgQLlB9fg2kObw.wDw9sYgEJB3CMo24rSpdZIUSSxQPWte",
      "name": "Maria da Silva",
      "dateOfBirth": "22/12/99",
      "CPF": "009888697621",
      "is_admin": "false",
      "id": 2
    },
    {
      "email": "jose@mail.com",
      "password": "$2a$10$2E.akrPv4xnVc/jM6.FIR.Ppr1LoiH2uiA57qMLjIOlREI98XG9Je",
      "name": "Jose da Silva",
      "dateOfBirth": "12/09/99",
      "CPF": "123888697621",
      "is_admin": "false",
      "id": 3
    }
  ],
  "vaccines": [
    {
      "name": "BCG",
      "quantity": 3,
      "price": 190,
      "date": "10 de janeiro",
      "information": "A vacina BCG é a vacina contra tuberculose e a principal maneira de prevenir que crianças contraiam a doença, principalmente nas formas graves. A tuberculose é uma doença grave transmitida pelo ar e pode atingir todos os órgãos do corpo, principalmente os pulmões.",
      "img": "https://uploaddeimagens.com.br/images/004/379/061/full/image_39_%282%29.png?1678129718",
      "id": 1
    },
    {
      "name": "Gripe - Tetravalente ",
      "quantity": 2,
      "price": 40,
      "date": "20 de fevereiro",
      "information": "A Vacina da Gripe Tetravalente protege contra as variantes H1N1 (também conhecida como gripe suína) e a variante da linhagem “Darwin” - H3N2 (conhecida como gripe sazonal) do vírus Influenza tipo A e também protege contra duas cepas virais da Influenza B.",
      "img": "https://uploaddeimagens.com.br/images/004/379/061/full/image_39_%282%29.png?1678129718",
      "id": 2
    },
    {
      "name": "Triplice Viral",
      "quantity": 2,
      "price": 100,
      "date": "12 de janeiro",
      "information": "A vacina tríplice viral é indicada para proteger contra os vírus do sarampo, caxumba e rubéola, em adultos e crianças com mais de 1 ano de idade, prevenindo o desenvolvimento destas doenças e suas possíveis complicações para a saúde.",
      "img": "https://uploaddeimagens.com.br/images/004/379/061/full/image_39_%282%29.png?1678129718",
      "id": 3
    },
    {
      "name": "Meningite",
      "quantity": 2,
      "price": 330,
      "date": "25 de março",
      "information": "A Vacina de Meningite ACWY (Menveo) protege contra: Meningites e infecções generalizadas (doenças meningocócicas) causadas pela bactéria meningococo dos tipos A, C, W e Y.",
      "img": "https://uploaddeimagens.com.br/images/004/379/061/full/image_39_%282%29.png?1678129718",
      "id": 4
    },
    {
      "name": "DT Adulto",
      "quantity": 3,
      "price": 200,
      "date": "10 de abril",
      "information": "A vacina dupla do tipo adulto dT é indicada a partir dos sete anos de idade em pessoas que não receberam nenhuma dose da DTP ou da DT, ou que não completaram o esquema básico com uma dessas vacinas, ou cujo estado vacinal não é conhecido. É empregada ainda como reforço da vacinação efetuada com a tríplice DTP ou com a dupla infantil DT",
      "img": "https://uploaddeimagens.com.br/images/004/379/061/full/image_39_%282%29.png?1678129718",
      "id": 5
    },
    {
      "name": "Poliomielite",
      "quantity": 5,
      "price": 110,
      "date": "4 de abril",
      "information": " É uma vacina oral atenuada bivalente, ou seja, composta pelos vírus da pólio tipos 1 e 3, vivos, mas “enfraquecidos”. Contém ainda cloreto de magnésio, estreptomicina, eritromicina, polissorbato 80, L-arginina e água destilada.",
      "img": "https://uploaddeimagens.com.br/images/004/379/061/full/image_39_%282%29.png?1678129718",
      "id": 6
    },
    {
      "name": "Influenza",
      "quantity": 2,
      "price": 70,
      "date": "1 de março",
      "information": "Composta por vírus mortos. Por ser um vírus que muda muito (mutante), a cada ano, uma nova vacina é desenvolvida, pois são levados em consideração os tipos de vírus que estão circulando no momento. A Organização Mundial da Saúde (OMS) recomenda, a cada ano, quais tipos de vírus que devem ser utilizados para fazer a vacina.",
      "img": "https://uploaddeimagens.com.br/images/004/379/061/full/image_39_%282%29.png?1678129718",
      "id": 7
    },
    {
      "name": "Herpes Zoster",
      "quantity": 2,
      "price": 549,
      "date": "15 de janeiro",
      "information": "A vacina previne contra a doença herpes zóster, popularmente conhecido como “cobreiro”, que traz como sua principal complicação, a neuropatia pós-herpética, causando dor crônica, prolongada, de difícil controle e extremamente debilitante.",
      "img": "https://uploaddeimagens.com.br/images/004/379/061/full/image_39_%282%29.png?1678129718",
      "id": 8
    },
    {
      "name": "Covid",
      "quantity": "1 por ano",
      "price": 280,
      "date": "20 de março",
      "information": "As vacinas da COVID-19 funcionam estimulando o sistema imunológico a produzir uma resposta de defesa contra o vírus. Elas contêm uma pequena porção do vírus ou material genético do vírus, que pode ser uma proteína específica ou um RNA mensageiro (mRNA) que codifica a proteína do pico do vírus. O mRNA é uma molécula que fornece instruções para as células do corpo produzirem uma proteína viral específica, que é então reconhecida pelo sistema imunológico como estranha. O sistema imunológico então produz anticorpos e células de defesa para combater a proteína do pico e o vírus real se ele invadir o corpo.",
      "img": "https://uploaddeimagens.com.br/images/004/379/061/full/image_39_%282%29.png?1678129718",
      "id": 9
    },
    {
      "name": "Hepatite A",
      "quantity": 3,
      "price": 200,
      "date": "15 de fevereiro",
      "information": "A vacina Hepatite A é uma vacina inativada, ou seja, não causa a doença. A composição da vacina Hepatite A difere de uma fabricante para a outra: GSK - Excipientes: hidróxido de alumínio, polissorbato 20, aminoácidos, fosfato dissódico, fosfato monopotássico, cloreto de sódio, cloreto de potássio e água para injeção. Resíduo: sulfato de neomicina. MSD - Excipientes: sulfato de hidroxifosfato alumínio amorfo, borato de sódio, cloreto de sódio e água para injetáveis.",
      "img": "https://uploaddeimagens.com.br/images/004/379/061/full/image_39_%282%29.png?1678129718",
      "id": 10
    }
  ],
  
  "vacAlreadyTaken": [
    {
      "name": "",
      "data": "",
      "img": "",
      "user_id": 2,
      "vaccine_id": 1
    }
  ]
}
